/*M!999999\- enable the sandbox mode */ 
-- MariaDB dump 10.19  Distrib 10.11.9-MariaDB, for Linux (x86_64)
--
-- Host: localhost    Database: joeu_fish
-- ------------------------------------------------------
-- Server version	10.11.9-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Dumping data for table `tcodebook`
--

LOCK TABLES `tcodebook` WRITE;
/*!40000 ALTER TABLE `tcodebook` DISABLE KEYS */;
REPLACE INTO `tcodebook` VALUES
(1,'001','명절|기념일','000','명절/기념일 분류','한국의 주요 명절 및 기념일 코드북',1,'Y',NULL,'2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(2,'001','명절|기념일','001','설날','음력 1월 1일, 설날',10,'Y','매년 음력 1월 1일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(3,'001','명절|기념일','002','단오','음력 5월 5일, 단오',20,'Y','매년 음력 5월 5일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(4,'001','명절|기념일','003','추석','음력 8월 15일, 추석',30,'Y','매년 음력 8월 15일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(5,'001','명절|기념일','004','한식','청명 후 105일, 한식일',40,'Y','청명 후 105일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(6,'001','명절|기념일','005','신정','양력 1월 1일, 신정',100,'Y','매년 1월 1일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(7,'001','명절|기념일','006','삼일절','3.1 운동 기념일',110,'Y','매년 3월 1일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(8,'001','명절|기념일','007','어린이날','어린이날',120,'Y','매년 5월 5일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(9,'001','명절|기념일','008','부처님오신날','음력 4월 8일',130,'Y','매년 음력 4월 8일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(10,'001','명절|기념일','009','현충일','국가유공자 추모일',140,'Y','매년 6월 6일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(11,'001','명절|기념일','010','광복절','광복절',150,'Y','매년 8월 15일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(12,'001','명절|기념일','011','개천절','개천절',160,'Y','매년 10월 3일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(13,'001','명절|기념일','012','한글날','한글날',170,'Y','매년 10월 9일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(14,'001','명절|기념일','013','크리스마스','성탄절',180,'Y','매년 12월 25일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(15,'001','명절|기념일','014','밸런타인데이','밸런타인데이',200,'Y','매년 2월 14일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(16,'001','명절|기념일','015','화이트데이','화이트데이',210,'Y','매년 3월 14일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(17,'001','명절|기념일','016','어버이날','어버이날',220,'Y','매년 5월 8일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(18,'001','명절|기념일','017','스승의날','스승의날',230,'Y','매년 5월 15일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(19,'001','명절|기념일','018','국군의날','국군의날',240,'Y','매년 10월 1일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(20,'001','명절|기념일','019','할로윈','할로윈',250,'Y','매년 10월 31일','2025-04-03 06:56:39','ADMIN','2025-04-04 08:09:14',NULL),
(21,'002','행사기획','000','행사기획분류','행사기획 관련 코드 분류',1,'Y',NULL,'2025-04-03 07:33:55','ADMIN','2025-04-03 07:33:55',NULL),
(22,'002','행사기획','001','기타행사','분류에 속하지 않는 기타 행사',10,'Y',NULL,'2025-04-03 07:33:55','ADMIN','2025-04-03 07:33:55',NULL);
/*!40000 ALTER TABLE `tcodebook` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-07-29  1:00:09
