/*M!999999\- enable the sandbox mode */ 
-- MariaDB dump 10.19  Distrib 10.11.9-MariaDB, for Linux (x86_64)
--
-- Host: localhost    Database: joeu_fish
-- ------------------------------------------------------
-- Server version	10.11.9-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Dumping data for table `tcomcodegs`
--

LOCK TABLES `tcomcodegs` WRITE;
/*!40000 ALTER TABLE `tcomcodegs` DISABLE KEYS */;
INSERT INTO `tcomcodegs` VALUES
(108,'1','점코드','62970','이천센터',NULL,0,'이천',1,'Y',0,NULL,'2024-06-18 08:13:22','joeunfish',NULL,NULL),
(109,'1','점코드','60470','양산센터',NULL,0,'양산',2,'Y',0,NULL,'2024-06-18 08:13:22','joeunfish',NULL,NULL),
(110,'1','점코드','66970','남사센터','',0,'남사',3,'n',0,'','2024-06-18 08:13:22','joeunfish','2025-07-14 05:19:05','proxima'),
(111,'1','점코드','62980','이천2센터',NULL,0,'이천',4,'Y',0,NULL,'2024-06-18 08:13:22','joeunfish',NULL,NULL),
(112,'2','상품코드','8809611290037','생연어-250g','EA',0,'노르웨이',1,'Y',5,'10137','2024-06-18 08:13:22','joeunfish','2025-05-06 07:49:07','ha1217'),
(113,'2','상품코드','8809611290259','스테이크-350g','EA',0,'노르웨이',2,'n',5,NULL,'2024-06-18 08:13:22','joeunfish',NULL,NULL),
(114,'2','상품코드','8809611290365','스테이크-300g','EA',0,'노르웨이',2,'Y',5,'10144','2024-06-18 08:13:22','joeunfish',NULL,NULL),
(115,'2','상품코드','8809611290242','생연어-1.2kg','EA',0,'노르웨이',3,'Y',5,'10134','2024-06-18 08:13:22','joeunfish',NULL,NULL),
(116,'2','상품코드','8809611290235','스테이크 1.5kg','EA',0,'노르웨이',4,'n',5,'','2024-06-18 08:13:22','joeunfish','2024-11-11 23:23:00','ha1217'),
(117,'2','상품코드','8809182440954','냉동연어필렛 500g','EA',0,'노르웨이',5,'n',7,'','2024-06-18 08:13:22','joeunfish','2025-04-02 08:16:59','ha1217'),
(118,'2','상품코드','8809611290273','생연어-1.3kg','EA',0,'노르웨이',6,'n',5,'','2024-06-18 08:13:22','joeunfish','2025-05-09 04:13:53','ha1217'),
(119,'2','상품코드','8809611290266','생연어-200g','EA',0,'노르웨이',7,'Y',5,'10140','2024-06-18 08:13:22','joeunfish','2025-05-06 07:51:24','ha1217'),
(120,'2','상품코드','2345001808018','냉동연어필렛 1kg','EA',0,'노르웨이',8,'n',12,'20110','2024-06-18 08:13:22','joeunfish','2025-05-09 04:14:13','ha1217'),
(121,'2','상품코드','8809611290105','우럭매운탕 1400g','EA',0,'국산',9,'n',3,'','2024-06-18 08:13:22','joeunfish','2025-05-09 04:14:31','ha1217'),
(122,'2','상품코드','8809611290228','문어해물탕 1800g','EA',0,'기타',10,'n',3,'','2024-06-18 08:13:22','joeunfish','2025-05-09 04:14:47','ha1217'),
(123,'2','상품코드','8809722430032','명태조림 2150g(미국산)','EA',0,'미국',11,'n',3,'','2024-06-18 08:13:22','joeunfish','2025-05-09 04:15:01','ha1217'),
(124,'2','상품코드','8809611290327','자반고등어(3마리)','EA',0,'노르웨이',12,'n',6,'10603','2024-06-18 08:13:22','joeunfish','2025-05-09 04:15:14','ha1217'),
(125,'2','상품코드','8809611290334','자반고등어(4마리)','EA',0,'노르웨이',13,'n',6,'10604','2024-06-18 08:13:22','joeunfish','2025-05-09 04:15:26','ha1217'),
(126,'2','상품코드','8809611290341','자반고등어(2마리)','EA',0,'노르웨이',14,'n',6,'10605','2024-06-18 08:13:22','joeunfish','2025-05-09 04:15:38','ha1217'),
(127,'1','점코드','60000','(주)지에스리테일','',0,'GS',6,'N',0,'','2024-07-23 11:52:38','joeunfish','2024-12-24 00:32:33','root'),
(128,'2','상품코드','2345001906547','스테이크-400g(소금간)','EA',0,'노르웨이',4,'y',5,'10145','2024-11-11 23:22:33','ha1217','2025-03-11 00:57:42','ha1217'),
(129,'1','점코드','68970','부산센터','',0,'부산',5,'Y',0,'','2024-12-24 00:32:13','root','2024-12-24 00:32:45','root'),
(130,'2','상품코드','2345001907094','스테이크-400g(소금간)','EA',0,'노르웨이',4,'n',5,'10145','2025-02-17 08:04:41','proxima','2025-03-11 00:57:53','ha1217'),
(131,'2','상품코드','2345001908602','고등어조림-1.1kg','EA',0,'노르웨이',15,'n',3,'10606','2025-03-19 03:21:01','ha1217','2025-05-09 04:15:56','ha1217'),
(132,'2','상품코드','8809611290396','스테이크-400g(소금간)','EA',0,'노르웨이',5,'y',5,'10145','2025-04-02 08:16:12','ha1217','2025-04-02 08:16:39','ha1217'),
(133,'2','상품코드','2345001912999','생연어-300g','EA',0,'노르웨이',8,'Y',5,'10148','2025-06-02 07:32:01','ha1217','2025-06-05 01:41:13','ha1217'),
(134,'1','점코드','67370','화성센터','',0,'화성',3,'y',0,'','2025-07-14 05:21:46','proxima',NULL,NULL);
/*!40000 ALTER TABLE `tcomcodegs` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-07-17  2:30:04
