/*M!999999\- enable the sandbox mode */ 
-- MariaDB dump 10.19  Distrib 10.11.9-MariaDB, for Linux (x86_64)
--
-- Host: localhost    Database: joeu_fish
-- ------------------------------------------------------
-- Server version	10.11.9-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Dumping data for table `tasks`
--

LOCK TABLES `tasks` WRITE;
/*!40000 ALTER TABLE `tasks` DISABLE KEYS */;
REPLACE INTO `tasks` VALUES
(1,'[공지사항] 메뉴 추가','공지사항, 구매요청 등 관리팀에 요청 및 협조 사항을 올려주세요.','2024-12-16','y','y','n','2024-12-14 04:16:20','root','2024-12-16 02:08:49',''),
(2,'TEST::구매요청(예시)','TEST::3공장 o o 재료가 부족합니다.','2023-12-31','y','y','n','2024-12-14 04:18:01','root','2024-12-14 04:30:12',''),
(3,'[공지사항] 메뉴 추가','공지사항, 구매요청 등 관리팀에 요청 및 협조 사항을 올려주세요','2024-12-16','y','y','n','2024-12-16 02:09:10','root','2025-02-18 02:28:03','ha1217'),
(4,'회의공지','오늘 12/16\n12시 50분 3공장 사장님실 에서 팀장회의 있습니다.','2023-12-31','y','y','n','2024-12-16 03:45:56','elinux','2024-12-18 23:47:27','root'),
(5,'생산팀 구매하거 있습니다.ㅛ','장갑 100장 구매부탁합니다.ㅅ','2023-12-31','y','y','n','2024-12-16 03:57:28','joeunfish','2025-02-19 05:55:13',''),
(6,'회의공지[12/16(월) 12:50]','오늘 12/16\n12시 50분 3공장 사장님실 에서 팀장회의 있습니다.','2024-12-16','y','y','n','2024-12-16 05:28:05','root','2024-12-16 09:58:46','root'),
(7,'사용자없음','사용자없음 내용','2024-12-17','y','y','n','2024-12-17 00:39:23','','2024-12-17 00:39:32',''),
(8,'제목','내용1','2024-12-17','y','y','n','2024-12-17 01:10:12','','2024-12-17 01:10:24',''),
(9,'[공지]팀장회의','오늘 12/23 12시 50분 3공장 사장님실 에서 팀장회의 있습니다','2020-12-31','y','y','n','2024-12-23 02:49:59','root','2025-01-01 00:17:19','root'),
(10,'[전산::1층입고]수기입력 기능추가','B/L번호 및 바코드1, 2 가 특수한 경우, ▶중량, 생산일을 [수기입력]으로 저장할 수 있습니다.','2024-12-31','y','y','n','2024-12-26 02:32:18','root','2025-02-17 03:44:24','root'),
(11,'[전산::(co)상품출고]출력변경','데친문어개별중량 갯수 42Box 1장에 나오도록 수정. 그 이상은 인쇄옵션>설정더보기>배율을 -10%씩 조정하여 출력.','2024-12-31','y','y','n','2024-12-31 06:29:20','root','2025-02-17 03:44:21','root'),
(12,'주문관리::예외사항','제주은갈치는 주문이 없어도 재고가 보입니다. 그 외 상품은 주문이 없으면 주문관리 목록에서 보이지 않습니다.','2024-12-31','y','y','n','2025-01-13 04:48:31','root','2025-02-17 05:53:36','proxima'),
(13,'[1층-구매요청] 위생장갑(비닐) 2박스','[1층-구매요청] 위생장갑(비닐) 2박스','2025-01-14','y','y','n','2025-01-14 09:39:09','gapan777','2025-02-17 05:53:33','proxima'),
(14,'원료 입고 공지합니다','2/18일 도착 상명물류입니다. \n고등어250박스(20250204-살마(PELAGIA)\n문어 200박스(20241112-피시원)','2025-03-31','y','y','n','2025-02-17 06:00:07','eunhwa','2025-04-15 02:36:58','eunhwa'),
(15,'명태 입고::이동 공지합니다.','테스트 공지입니다. 2/17(월) 명태 입고 후 이동량을 공지하오니, 생산일지에 적용해서 사용하시기 바랍니다.','2025-02-17','y','y','n','2025-02-17 06:05:36','root','2025-02-18 02:27:58','ha1217'),
(16,'원료 입고 공지합니다','2/19일 도착 김지인 사장님입니다. 고등어250박스(20250204-살마(PELAGIA)\n연어알50박스 (20240927-PACIFC)\n명태6빠렛트(20250203-미래농수산)','2025-03-31','y','y','n','2025-02-18 08:40:33','eunhwa','2025-04-15 02:36:48','eunhwa'),
(17,'제목1','내용1\n\n\n\n\n내용2','2025-02-19','y','y','n','2025-02-19 05:55:13','root','2025-02-19 05:55:30','root'),
(18,'원료 입고 공지합니다','2/21일 도착 김지인 사장님 문어(20241107-피시원 ) 8미78 9미12 10미54 11미27 12미14 13미10 15미5 합계200박스  명태6빠렛트(20250203-미래농수산) 낙지300박스(바다향기)','2025-03-31','y','y','n','2025-02-20 01:04:19','eunhwa','2025-04-15 02:37:03','eunhwa'),
(19,'원료 입고 공지합니다','2/25일 도착 상명물류// 고등어65박스(20250204-살마(PELAGIA) 135박스(20250224-살마(PELAGIA) 합계200박스 명태5빠렛트(20250203-미래농수산) \n','2025-03-31','y','y','n','2025-02-24 07:30:45','eunhwa','2025-04-15 02:36:51','eunhwa'),
(20,'원료 입고 공지합니다','2/26일 도착 김지인사장님// 고등어 300박스(20250224-살마(PELAGIA)  명태6빠렛트(20250203-미래농수산) ','2025-03-31','y','y','n','2025-02-25 08:47:04','eunhwa','2025-04-15 02:36:53','eunhwa'),
(21,'원료 입고 공지합니다','2/28일 도착 김지인사장님//명태7빠렛트(20250203-미래농수산) 문어300박스 8미152 9미48 10미6 11미15 12미17 13미32 14미11 15미19(20250108-피시원)','2025-03-31','y','y','n','2025-02-27 08:54:40','eunhwa','2025-04-15 02:37:00','eunhwa'),
(22,'I-cut 130 절단기 수리','3/4(화) 오전 marel 엔지니어 방문 예정. \n▶ 방문 목적: PLC 소프트웨어 업데이트 외 기계 점검\n※ 원격 지원이 복잡하여 방문 지원으로 결정 함. (2/27)','2025-03-31','y','y','n','2025-02-28 05:34:34','root','2025-04-15 06:51:28','eunhwa'),
(23,'원료 입고 공지합니다','고등어250박스(20250224-살마(PELAGIA) 명태6빠렛트(20250203-미래농수산)','2025-06-04','y','y','n','2025-03-04 01:23:43','eunhwa','2025-03-04 01:26:13','eunhwa'),
(24,'원료 입고 공지합니다','3/5일 도착 상명물류입니다.\n고등어250박스(20250224-살마(PELAGIA) 명태6빠렛트(20250203-미래농수산)','2025-06-04','y','y','n','2025-03-04 01:27:25','eunhwa','2025-03-04 02:29:33','eunhwa'),
(25,'원료 입고 공지합니다','3/5일 도착 상명물류입니다.\n고등어300박스(20250224-살마(PELAGIA) 명태4빠렛트(20250203-미래농수산) 흰다리새우 50박스(20250224-살마) 고등어필렛 50박스','2025-06-04','y','y','n','2025-03-04 02:31:22','eunhwa','2025-04-15 02:37:06','eunhwa'),
(26,'원료 입고 공지합니다','3/11일 도착 상명물류입니다.\n고등어130박스(20250224-살마(PELAGIA) 고등어70박스(살마20250310-살마BRODRENE SPERRE AS) 명태5빠렛트(20250203-미래농수산) ','2025-06-10','y','y','n','2025-03-10 06:07:45','eunhwa','2025-04-15 02:37:09','eunhwa'),
(27,'원료 입고 공지합니다','3/12일 도착 김지인사장님입니다.\n 고등어200박스(살마20250310-살마BRODRENE SPERRE AS) 명태5빠렛트(20250203-미래농수산) 문어200박스 8미31 9미84 10미85(241213-피시원)','2025-06-11','y','y','n','2025-03-11 08:32:20','eunhwa','2025-04-15 02:36:45','eunhwa'),
(28,'원료 입고 공지합니다','3/14일 도착 김지인사장님입니다. 고등어200박스(살마20250310-살마BRODRENE SPERRE AS) 명태8빠렛트(20250203-미래농수산)','2025-06-13','y','y','n','2025-03-13 08:49:00','eunhwa','2025-04-15 02:37:14','eunhwa'),
(29,'원료 입고 공지합니다','3/18일 도착 상명물류입니다.\n고등어200박스(살마20250310-살마BRODRENE SPERRE AS) 명태7빠렛트(20250203-미래농수산) ','2025-06-17','y','y','n','2025-03-17 07:29:52','eunhwa','2025-05-24 00:22:35','proxima'),
(30,'원료 입고 공지합니다','3/21일 도착 김지인사장님입니다. 고등어350박스(살마20250310-살마BRODRENE SPERRE AS) 냉동꽃게 254박스(20241016-피시원)','2025-06-20','y','y','n','2025-03-20 09:06:58','eunhwa','2025-05-24 00:25:54','proxima'),
(31,'원료 입고 공지합니다','4/3일 도착 상명물류입니다냉동연어(trim-e)337박스 연어알 50박스(20240927-PACIFC) 흰다리 300박스(20250224-살마)','2025-07-02','y','y','n','2025-04-02 00:58:09','eunhwa','2025-05-24 00:25:57','proxima'),
(32,'원료 입고 공지합니다','4/4일 도착 상명물류입니다냉동연어(trim-e)137박스\n4/4일 도착 김지인사장님 고등어100박스(살마20250310-살마BRODRENE SPERRE AS) \n 명태10빠렛트(20250203-미래농수산)','2025-07-03','y','y','n','2025-04-03 02:31:06','eunhwa','2025-05-24 00:26:06','proxima'),
(33,'원료 입고 공지합니다','4/8일 도착 상명물류입니다 고등어145박스(20250324-살마(PELAGIA)) 고등어45박스(20250407-살마(PELAGIA)\n 명태5빠렛트(20250203-미래농수산) 문어 200박스 (8미57 10미67 11미66 14미6 15미4)','2025-07-08','y','y','n','2025-04-08 09:31:47','eunhwa','2025-05-24 00:26:22','proxima'),
(34,'원료 입고 공지합니다','4/9일 도착 상명물류입니다\n문어200박스 (4미1 5미173 6미3 7미23) 명태8빠렛트(20250203-미래농수산)','2025-07-09','y','y','n','2025-04-09 02:04:40','eunhwa','2025-05-24 00:26:36','proxima'),
(35,'원료 입고 공지합니다','4/11일 도착 김지인사장님입니다  고등어300박스(20250407-살마(PELAGIA)\n명태1빠렛트(20250203-미래농수산) 흰다리새우300박스(20250224-살마) 냉동고등어1,000박스(20250410-살마)','2025-07-10','y','y','n','2025-04-10 06:36:55','eunhwa','2025-05-24 00:26:40','proxima'),
(36,'원료 입고 공지합니다','4/16일 도착 김지인사장님입니다\n 명태 4빠렛트(20250203-미래농수산) 고등어200박스(20250407-살마(PELAGIA) 냉동꽃게 200박스(20241016-피시원)','2025-07-15','y','y','n','2025-04-15 06:51:28','eunhwa','2025-05-24 00:26:52','proxima'),
(37,'원료 입고 공지합니다',' 4/17일 도착 상명물류입니다 명태  7빠렛트(20250203-미래농수산) 문어200박스(9미 72 10미128)','2025-07-16','y','y','n','2025-04-16 06:13:46','eunhwa','2025-05-24 00:26:56','proxima'),
(38,'원료 입고 공지합니다',' 4/30일 도착 김지인 사장님입니다   문어300박스(8-14미 20250106-피시원) 고등어 400박스 20250422-살마(PELAGIA) 명태 450박스 (20250418-PACIFIC) 흰다리새우 300박스(20250224-살마)','2025-07-29','y','y','n','2025-04-29 05:24:09','eunhwa','2025-05-24 00:27:00','proxima'),
(39,'원료 입고 공지합니다',' 5/1일 도착 김지인 사장님입니다 고등어 300박스 20250429-살마(PELAGIA) 명태 550박스 (20250418-PACIFIC )','2025-07-30','y','n','n','2025-04-30 04:36:35','eunhwa','2025-07-15 01:37:00','eunhwa'),
(40,'원료 입고 공지합니다','5/3일 도착 상명물류입니다 문어 200박스 (5~7미)','2025-08-02','y','n','n','2025-05-02 06:34:54','eunhwa','2025-07-15 01:37:01','eunhwa'),
(41,'원료 입고 공지합니다','5/13일 도착 상명입니다 고등어 200박스 20250429-살마(PELAGIA) 명태 200박스 (20250418-PACIFIC ) 블랙타이거새우 200박스(20250426-DE COSTI)','2025-08-13','y','n','n','2025-05-13 01:24:26','eunhwa','2025-07-15 01:37:02','eunhwa'),
(42,'원료 입고 공지합니다','5/14일 도착 김지인 사장님입니다 고등어 200박스 20250429-살마(PELAGIA) 문어 200박스 (20241104-피시원) 연어알 60박스(20250512-퍼시픽) 꽂게 300박스(20231120-피시원)','2025-08-13','y','n','n','2025-05-13 01:29:43','eunhwa','2025-07-15 01:37:04','eunhwa'),
(43,'원료 입고 공지합니다','5/15일 도착 상명입니다 고등어필렛 400박스(20250514-살마) 명태 300박스 (20250418-PACIFIC ) ','2025-08-14','y','n','n','2025-05-14 08:31:19','eunhwa','2025-07-15 01:37:05','eunhwa'),
(44,'원료 입고 공지합니다','5/20일 도착 상명입니다 고등어 300박스(20250515-살마) 명태 200박스 (20250418-PACIFIC ) ','2025-08-19','y','n','n','2025-05-19 05:20:12','eunhwa','2025-07-15 01:37:07','eunhwa'),
(45,'원료 입고 공지합니다','5/21일 도착 김지인 사장님입니다 고등어 200박스(20250515-살마) 명태 200박스 (20250418-PACIFIC ) 문어 300박스 (20250107-피시원)','2025-08-20','y','y','n','2025-05-20 06:22:56','eunhwa','2025-05-24 00:26:01','proxima'),
(46,'원료 입고 공지합니다','5/22일 도착 상명입니다 고등어필렛 900박스(20250521-살마) 블랙타이거새우 200박스 (20250426-DE COSTI) 낙지 400박스 (20250324-바다향기)','2025-08-22','y','n','n','2025-05-22 01:45:56','eunhwa','2025-07-15 01:37:08','eunhwa'),
(47,'원료 입고 공지합니다','5/23일 도착 김지인 사장님입니다 고등어 300박스 20250515-살마(PELAGIA) 명태 200박스 (20250418-PACIFIC) 블랙타이거새우 500박스(20250426-DE COSTI)','2025-08-22','y','n','n','2025-05-22 01:48:25','eunhwa','2025-07-15 01:37:10','eunhwa'),
(48,'원료 입고 공지합니다','5/27일 도착 상명입니다 고등어 300박스(20250515-살마(PELAGIA)) 명태 200박스 (20250418-PACIFIC )\n','2025-08-25','y','n','n','2025-05-26 06:54:54','eunhwa','2025-07-15 01:37:11','eunhwa'),
(49,'원료 입고 공지합니다','5/29일 도착 상명입니다\n흰다리 500박스(20250502-살마)','2025-08-31','y','n','n','2025-05-28 05:31:40','eunhwa','2025-07-15 01:37:12','eunhwa'),
(50,'원료 입고 공지합니다','6/3일 도착 김지인 사장님입니다 고등어 250박스 20250527-살마(PELAGIA) 문어500박스(250120-피시원) 6/3일 도착 상명물류입니다명태 200박스 (20250418-PACIFIC) 고등어 300박스 20250527-살마(PELAGIA)','2025-08-31','n','n','n','2025-06-02 02:12:27','eunhwa','2025-06-02 02:12:53','eunhwa'),
(51,'원료 입고 공지합니다','6/6일 도착 김지인 사장님입니다 고등어 50박스 20250527-살마(PELAGIA) 명태 200박스 (20250418-PACIFIC) 흰다리새우 300박스(20250502-살마) 고등어필렛 135g-200박스 155g-224박스 170g-176박스 합계 600박스 입니다','2025-08-31','n','n','n','2025-06-05 01:12:03','eunhwa','2025-06-05 01:12:33','eunhwa'),
(52,'원료 입고 공지합니다','6/10일 도착 상명입니다 고등어 105박스(20250527-살마(SPERRE AS)) 95박스(250609살마(SPERRE AS) 고등어합계 200박스 명태 300박스 (20250418-PACIFIC )','2025-08-31','n','n','n','2025-06-09 05:25:52','eunhwa','2025-06-09 05:25:52','eunhwa'),
(53,'원료 입고 공지합니다','6/18일 도착 김지인 사장님입니다 고등어 200박스(20250609-살마(SPERRE AS)) 문어 511박스 /7미(20240705-피시원)','2025-09-30','n','n','n','2025-06-17 02:00:52','eunhwa','2025-06-23 09:27:32','eunhwa'),
(54,'원료 입고 공지합니다','6/19일 도착 상명입니다 문어  8미50 9미50 10-15미100 합계 200박스입니다(20250618-피시원) 고등어필렛 115G-100 135G-100 155G-300 170G-100(2025-0603-피시원) 합계600박스입니다','2025-09-30','n','n','n','2025-06-18 01:27:03','eunhwa','2025-06-18 01:31:38','eunhwa'),
(55,'원료 입고 공지합니다','6/24일 도착 상명입니다 고등어 200박스(20250623-살마(PELAGIA) 고등어필렛 600박스(20250603-피시원) 115g-100 135g-150 155g-250 170g-100 블랙타이거새우 170박스','2025-09-30','n','n','n','2025-06-23 09:26:52','eunhwa','2025-06-23 09:28:05','eunhwa'),
(56,'원료 입고 공지합니다','6/27일 도착 김지인사장님입니다 고등어 200박스(20250623-살마(PELAGIA) 고등어필렛 600박스(20250603-살마) 115g-96 135g-195 155g-200 170g-109 연어알 60박스(20240927-PACIFC) 명태 200박스(20250507-PACIFIC)','2025-09-30','n','n','n','2025-06-26 04:49:08','eunhwa','2025-06-26 04:50:42','eunhwa'),
(57,'원료 입고 공지합니다','7/1일 도착 상명물류입니다 고등어 200박스(20250623-살마(PELAGIA) 명태 200박스(20250507-PACIFIC)','2025-09-30','n','n','n','2025-06-30 04:20:01','eunhwa','2025-06-30 04:20:38','eunhwa'),
(58,'원료 입고 공지합니다','7/2일 도착 김지인사장님입니다 고등어 200박스(20250623-살마(PELAGIA) 명태 200박스(20250507-PACIFIC) 흰다리100박스(20250502-살마) 문어292박스(20250618-피시원)','2025-09-30','n','n','n','2025-07-01 02:12:21','eunhwa','2025-07-01 02:12:21','eunhwa'),
(59,'원료 입고 공지합니다','7/10일 도착 상명물류입니다고등어 300박스(20250703-살마(GLOBAL)  냉동꽃게 26박스(20250421-피시원) 문어쌤플 1박스(모리타니아)','2025-09-30','n','n','n','2025-07-09 02:40:53','eunhwa','2025-07-09 02:40:53','eunhwa'),
(60,'원료 입고 공지합니다','7/15일 도착 상명물류입니다고등어 65박스(20250703-살마(GLOBAL)  명태 300박스(20250507-PACIFIC)','2025-09-30','n','n','n','2025-07-15 01:36:42','eunhwa','2025-07-15 01:40:03','eunhwa'),
(61,'원료 입고 공지합니다','7/15일 도착 상명물류입니다고등어 65박스(20250703-살마(GLOBAL) 명태 300박스(20250507-PACIFIC)','2025-08-31','y','y','n','2025-07-15 01:39:05','eunhwa','2025-07-15 01:39:47','eunhwa'),
(62,'원료 입고 공지합니다','7/16일 도착 김지인사장님입니다 고등어 200박스(20250715-살마(GLOBAL)  명태 200박스(20250507-PACIFIC) 문어 200박스(20250715-피시원)\n\n','2025-09-30','n','n','n','2025-07-15 01:42:15','eunhwa','2025-07-15 01:43:28','eunhwa'),
(63,'원료 입고 공지합니다','7/18일 도착 김지인사장님입니다 고등어 300박스(20250715-살마(GLOBAL)  블랙타이거새우 500박스\n고등어필렛 600박스(20250603-살마)135g-300   155g-300 ','2025-09-30','n','n','n','2025-07-17 05:34:18','eunhwa','2025-07-17 05:34:18','eunhwa'),
(64,'원료 입고 공지합니다','7/22일 도착 상명물류입니다고등어200박스(20250715-살마(GLOBAL)  명태 200박스(20250507-PACIFIC)','2025-09-30','n','n','n','2025-07-22 02:06:17','eunhwa','2025-07-22 02:06:17','eunhwa'),
(65,'원료 입고 공지합니다','7/23일 도착 김지인사장님입니다 고등어 200박스(20250715-살마(GLOBAL) 문어 300박스(20250623-피시원)\n고등어필렛 300박스(20250603-살마)135g-150 155g-150\n','2025-09-30','n','n','n','2025-07-22 02:07:46','eunhwa','2025-07-22 02:08:18','eunhwa');
/*!40000 ALTER TABLE `tasks` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-07-27  1:00:05
